app/controllers/admin/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.sorted
                 .paginate(page: params[:page], per_page: Settings.per_page)

INSERT INTO `users` (`name`, `email`, `password_digest`, `role`, `created_at`, `updated_at`) VALUES ('Nguyen Thanh Tu', 'nguyen.thanh.tu@sun-asterisk.com', '$2a$12$db09ZTvS7eSqdo/brCBtAedO9wBel3Kuf.zyU2sxJdta5zBUJwfzq', 1, '2019-06-12 10:51:34', '2019-06-12 10:51:34')
---
  def create
    @user = User.new user_params
    @user.role = User.roles[:supervisor]
    @user.password = Settings.password
    @user.password_confirmation = Settings.password
    if @user.save

DELETE FROM `users` WHERE `users`.`id` = 4
---
  def destroy
    if @user.destroy

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def load_user
    @user = User.find_by id: params[:id]