app/controllers/supervisor/courses_controller.rb

  def index
    @courses = Course.sorted
                     .paginate(page: params[:page], per_page: Settings.per_page)
---
SELECT `courses`.* FROM `courses`

  def create
    course = Course.new(course_params)
    course.created_by = current_user.id
---
INSERT INTO `courses` (`title`, `created_by`, `description`, `created_at`, `updated_at`) VALUES ('PHP', 2, 'course about PHP', '2019-06-13 08:13:26', '2019-06-13 08:13:26')

  def update
    if @course.update(course_params)
---
UPDATE `courses` SET `title` = '1111Ruby', `updated_at` = '2019-06-13 08:13:30' WHERE `courses`.`id` = 1

  def load_course
    @course = Course.find_by(id: params[:id])
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1