app/controllers/supervisor/subjects_controller.rb

  def create
    subject = Subject.new(subject_params)
    subject.created_by = current_user.id
---
INSERT INTO `subjects` (`title`, `created_by`, `description`, `created_at`, `updated_at`) VALUES ('asda', 2, 'sdasdasd', '2019-06-13 08:29:28', '2019-06-13 08:29:28')

  def update
    if @subject.update(subject_params)
---
UPDATE `subjects` SET `title` = 'asda1', `updated_at` = '2019-06-13 08:31:37' WHERE `subjects`.`id` = 1

  def destroy
    if @subject.destroy
---
DELETE FROM `subjects` WHERE `subjects`.`id` = 1

  def load_subject
    @subject = Subject.find_by(id: params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1