app/controllers/supervisor/users_controller.rb

  def index
    @users = User.sorted
                 .paginate(page: params[:page], per_page: Settings.per_page)
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users`

  def load_user
    @user = User.find_by id: params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1